abstra_notas/nfse/ce/fortaleza/templates/ConsultaNFe.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
    xmlns:ns="http://www.fortaleza.ce.gov.br/iss">
    <soap:Header/>
    <soap:Body>
        <ns:ConsultarNfsePorRps>
            <ns:IdentificacaoRps>
                <ns:Numero>{{ numero_rps }}</ns:Numero>
                <ns:Serie>{{ serie_rps }}</ns:Serie>
                <ns:Tipo>1</ns:Tipo>
            </ns:IdentificacaoRps>
            <ns:Prestador>
                <ns:Cnpj>{{ remetente if remetente_tipo == '2' else '' }}</ns:Cnpj>
                {% if remetente_tipo == '1' %}
                <ns:Cpf>{{ remetente }}</ns:Cpf>
                {% endif %}
                <ns:InscricaoMunicipal>{{ inscricao_prestador }}</ns:InscricaoMunicipal>
            </ns:Prestador>
        </ns:ConsultarNfsePorRps>
    </soap:Body>
</soap:Envelope>
